# Brewfile - Automated dependency installation
# Install with: brew bundle

# ============================================
# Taps
# ============================================
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# ============================================
# Core Tools
# ============================================
brew "git"
brew "stow"
brew "neovim"
brew "tree-sitter"

# ============================================
# Shell & Terminal
# ============================================
brew "zsh"
brew "fzf"
brew "zellij"

# ============================================
# CLI Utilities
# ============================================
brew "ripgrep"        # Fast grep
brew "eza"            # Modern ls
brew "lazygit"        # Git TUI
brew "sqlite"         # Database (for nvim plugins)

# ============================================
# Development Runtimes
# ============================================
brew "lua"
brew "luajit"
brew "python@3"
brew "go"
brew "elixir"
brew "erlang"
brew "odin"
brew "zig"

# ============================================
# Node/JS Ecosystem
# ============================================
brew "pnpm"

# ============================================
# Libraries & Dependencies
# ============================================
brew "luv"
brew "lpeg"
brew "gettext"
brew "pcre2"
brew "openssl@3"
brew "readline"
brew "xz"
brew "zstd"
brew "libgit2"
brew "libuv"
brew "jpeg-turbo"
brew "libpng"
brew "libtiff"
brew "libssh2"
brew "libtool"
brew "libunistring"
brew "lz4"
brew "m4"
brew "unibilium"
brew "unixodbc"
brew "utf8proc"
brew "wxwidgets@3.2"

# ============================================
# macOS UI
# ============================================
brew "sketchybar"
brew "glfw"           # Graphics lib (for sketchybar helper)
brew "raylib"

# ============================================
# Build Tools
# ============================================
brew "llvm@20"
brew "lld@20"

# ============================================
# Cask Applications
# ============================================
cask "kitty"          # Terminal
cask "claude-code"    # AI coding assistant

# ============================================
# Fonts
# ============================================
cask "font-hack-nerd-font"
cask "font-fira-code"
cask "font-sketchybar-app-font"

# ============================================
# Optional (Uncomment if desired)
# ============================================
# cask "raycast"      # Spotlight replacement
# brew "btop"         # System monitor
# brew "httpie"       # HTTP client
# brew "jq"           # JSON processor
# brew "gh"           # GitHub CLI
